Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: སྨྱིག་མའི་ཚལ་ལམ། འབྲས་ཀྱི་ཞིང་ངམ། ཏིལ་གྱི་ཞིང་ལྟར་ཞེས་བྱ་བ་ནི། །ཤིང་ལྗོན་པ་དང་། འཁྲི་ཤིང་ལ་སོགས་པ་བས་སྨན་གྱི་རྣམ་པ་དག་སྡུག་པའི་ཕྱིར་སྨན་དག་ཁོ་ན་བསྟན་ཏོ།
en: A thicket of naḍa reeds, or a thicket of bamboo, or a thicket of sugarcane, or a thicket of rushes, or a thicket of rice, or a thicket of sesame” teaches only types that are inferior because they are inferior to trees, creepers, and so on, which are attractive.

source: །དེ་དག་ལ་ཡང་རྣམ་པ་གསུམ་སྟེ། ཤིན་ཏུ་སྡུག་ཅིང་ཤིན་ཏུ་མཐོ་བ་དང་། །འབྲིང་དུ་སྡུག་ཅིང་འབྲིང་དུ་མཐོ་བ་དང་། །ཐ་མར་སྡུག་ཅིང་ཐ་མར་མཐོ་བ་རྣམས་སོ།
en: They are, furthermore, of three types: extremely attractive and extremely tall, middling attractive and middling tall, and least attractive and least tall.

source: །དེ་ལ་འདམ་བུ་དང་སྨྱིག་མ་གཉིས་ནི་ཤིན་ཏུ་སྡུག་ཅིང་ཤིན་ཏུ་མཐོའོ།
en: Among these, the two—naḍa reeds and rushes—are extremely attractive and extremely tall.

source: །བུ་རམ་ཤིང་དང་སྨྱིག་མ་དག་ནི་དེ་བས་དམའ་སྟེ་འབྲིང་ཡིན་པའི་ཕྱིར་བར་དུ་སྨོས་སོ།
en: It gives the sugarcane and bamboo in the middle because they are inferior to those and hence middling.

source: །འབྲས་དང་ཏིལ་དག་ནི་དེ་བས་སྲབ་ཅིང་དམའ་བས་ཐ་མ་པར་བརྗོད་དོ།
en: It sets forth the rice and sesame last because they are thinner than those, hence inferior.

source: །དེ་ལ་ཡང་སྨྱིག་མ་དང་འདམ་བུ་གཉིས་ལ་ཡང་། འདམ་བུ་ཁོང་སྟོང་དུ་འདུག་ལ་ཚེར་མ་མང་ཞིང་དེ་དག་ཉིད་རབ་ཏུ་སྡུག་པའི་ཕྱིར་སྔར་བསྟན་ཏེ།
en: Furthermore, among these, of the two, the rushes and the naḍa reeds, it teaches naḍa reeds first because they are hollow inside and have a lot of thorns and are themselves extremely attractive. “

source: སྨྱིག་མ་ནི་ཕྱིས་བསྟན་ཏོ།
en: Rushes” teaches the species in general.

source: །བུ་རམ་ཤིང་དང་སྨྱིག་མ་གཉིས་ལས་ཀྱང་བུ་རམ་ཤིང་ལོ་མ་བཟང་ཞིང་སྡུག་སྟེ། སྨྱིག་མས་དེ་ཙམ་མི་ཕོད་པས་བུ་རམ་ཤིང་སྔར་བསྟན་ཏོ།
en: Furthermore, it teaches the sugarcane before rushes because, of the two, the rushes and the sugarcane, rushes cannot stand up to even just the better and more attractive leaves of the sugarcane.

source: །འབྲས་དང་ཏིལ་གཉིས་ལས་ཀྱང་ཏིལ་བས་འབྲས་ཆེ་ཞིང་སྡུག་པས་ནི་སྔར་སྨོས་སོ། །བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: And again, of the two, the rice and the sesame, it mentions rice earlier because it is bigger and more attractive than sesame. “

source: །སྟོང་གི་ཆ་དང་། བརྒྱ་སྟོང་གི་ཆ་དང་འབུམ་གྱི་ཆ་དང་། གྲངས་དང་། ཆ་དང་། བགྲང་བ་དང་།
en: would not approach … even by a hundredth part, nor by a thousandth part, nor by a hundred thousandth part; it would not stand up to any number, or fraction, or counting, or analogy, or comparison.”

source: དཔེ་དང་རྒྱུར་ཡང་ཉེ་བར་མི་འགྲོའོ་ཞེས་བྱ་བ་ནི་རྣམ་པ་དེ་ལྟ་བུ་དག་ལ་ཡང་གཏན་ལ་ཕབ་ན་རྣམ་པ་བཞིར་འགྱུར་ཏེ། ཆར་ཡོངས་སུ་བཅད་པའམ། བགྲང་བའམ། དཔེ་འམ། རྒྱུ་དང་འབྲས་བུའི་དངོས་པོ་རྣམས་སོ།
en: When you conclusively explain these differences, they are of four sorts: part, number, analogy, and something to do with cause and effect.

source: །དེ་ལ་ཆར་ཡོངས་སུ་བཅད་པའི་ཡུལ་དུ་ཡང་མི་འགྱུར་བར་བསྟན་པ་ནི་བརྒྱའི་ཆར་ཡང་ཞེས་བྱ་བ་ནས་འབུམ་གྱི་ཆར་ཡང་ཞེས་བྱ་བའི་བར་དུའོ། །གྲངས་སུ་བགྲང་དུ་མི་རུང་བར་བསྟན་པ་ནི་གྲངས་དང་ཆ་དང་བགྲང་བ་དང་ཞེས་བྱའོ། །དཔེར་བྱར་ཡང་མི་རུང་བར་བསྟན་པ་ནི་དཔེར་ཡང་ཞེས་བྱའོ། །རྒྱུ་དང་འབྲས་བུའི་དངོས་པོར་ཡང་མི་རུང་བར་བསྟན་པ་ནི་རྒྱུར་ཡང་ཞེས་བྱའོ།
en: Among these, from “a hundredth part” up to “a hundred thousandth part” teaches that śrāvaka wisdom does not become an object for comparison even when the bodhisattvas’ knowledge has been cut into parts; “any number, or fraction, or counting” teaches that it cannot be counted in numbers; “or analogy” teaches that there is no possible analogy for it; and “or comparison” teaches that it is not suitable to be something to do with cause and effect.

source: །དེ་ལ་བརྒྱའི་ཆར་ཡང་ཞེས་བྱ་བ་ལ་ཆ་དང་ཆ་ཤས་དང་ཡན་ལག་ཅེས་བྱ་བ་ནི་དོན་གཅིག་གོ།
en: There, in “even one hundredth part,” a “part,” a “bit,” and a “branch” are the same.

source: །དགེ་སློང་དེ་དག་གི་ཤེས་རབ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱིས་བརྒྱར་བྱས་པའི་ཆའམ། སྟོང་དུ་བྱས་པའམ། བརྒྱ་སྟོང་དུ་བྱས་པའི་ཆར་ཡང་མི་ཕོད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means “the wisdom” of those monks does not stand up to even a fraction of “the wisdom of a bodhisattva” even if it has been divided up into one hundred parts, one thousand parts, or even a hundred thousand parts.

source: །གྲངས་སུ་བགྲང་བར་ཡང་རྣམ་པ་གསུམ་དུ་འགྱུར་ཏེ།
en: Again, a numerical counting is of three types.

source: གང་ལ་ཚིག་གི་སྤྱོད་ཡུལ་དུ་གྱུར་པ་དེ་ལ་ནི་གཅིག་དང་གཉིས་དང་གསུམ་ཞེས་པ་ནས། བརྒྱ་དང་སྟོང་ཞེས་བྱ་བའི་བར་དུ་ཚིག་གིས་བགྲང་བ་ལས་གྲངས་ཞེས་བྱ་སྟེ། དེ་ཡང་གྲངས་སུ་ཡང་ཞེས་བྱ་བས་བསྟན་ཏོ། །གང་ལ་ཚིག་གི་ཡུལ་དུ་གྱུར་པ་དེ་ལ་ནི་བརྩི་བ་དང་།
en: That which comes within the range of the words one, two, three, up to a hundred thousand, is a number counted in words. “

source: བྱུང་བ་གདབ་པ་དང་།
en: Number” teaches that.

source: བསྡོམ་པ་དང་། ཆ་ལ་དབྲི་བ་ལ་སོགས་པའམ། ཤོད་དགོད་པའམ། འགྲོན་བུ་ལ་སོགས་པ་དགོད་པའམ། ལག་རྩིས་ཀྱིས་བརྩི་བ་དག་ལ་ནི་ཆ་ཞེས་བྱ་བ་སྟེ།
en: A part is a calculation, a derivation, an addition, or a subtraction, and so on, performed on that which has become an object of the word for a particular number, or a calculation by reduction or by laying out cowrie shells and so on, or by hand. “

source: དེ་ཡང་ཆར་ཡང་ཞེས་བྱ་བས་བསྟན་ཏོ།
en: Part” teaches that.

source: །གང་ལ་དེ་ལྟ་བུར་བརྩི་མི་ནུས་པ་དེ་ལ་ནི་མངོན་པར་ཤེས་པའི་སྟོབས་འབའ་ཞིག་གིས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱའི་ཆ་དང་ཞེས་བྱ་བ་ནས། གྲངས་མེད་པ་ཞེས་བྱ་བའི་བར་དུ་བགྲང་བ་ལ་ནི་བགྲང་བ་ཞེས་བྱ་སྟེ།
en: Those from one hundred million billion, up to a number with no number above it, on which such calculation cannot be carried out and which are counted only through the power of clairvoyance, are a count. “

source: དེ་ཡང་བགྲང་བར་ཡང་ཞེས་པས་བསྟན་ཏོ།
en: Counting” teaches that.

source: །དེ་བཞིན་དུ་ཁ་ཅིག་ཏུ་བདག་ཉིད་ཐམས་ཅད་ཀྱིས་མཚུངས་པ་མ་ཡིན་དུ་ཟིན་ཀྱང་ཆ་ཤས་འགའ་ཞིག་འོལ་བྱིར་འདྲ་བ་ཡང་ཡོད་དོ།
en: Similarly, some things are not the same in all essentials, but are roughly similar in some respects.

source: །དེ་ལས་ངེས་པར་བྱར་རུང་བ་ནི་དཔེར་ན་སྨྱིག་གླང་ནི་བ་ལང་འདྲའོ་ཞེས་བྱ་བ་ལྟ་བུ་སྟེ།
en: It is suitable to ascertain what it is from that: for example, “a water buffalo is like a bull.”

source: དེ་ལྟ་བུ་ཡང་མེད་པས་དཔེར་ཡང་ཞེས་བྱ་བ་གསུངས་སོ།
en: Because nothing like it exists, it says “or analogy.”

source: །དེ་བཞིན་དུ་ཁ་ཅིག་དངོས་པོ་ཤིན་ཏུ་ཐ་དད་དུ་ཟིན་ཀྱང་། དུ་བ་མཐོང་ནས་རྒྱུའི་དངོས་པོ་ལས་མེའི་བློ་འབྱུང་སྟེ། རྗེས་སུ་དཔག་པ་དེ་ལྟ་བུ་ཡང་མེད་པས་རྒྱུར་ཡང་མི་ཕོད་ཅེས་བྱ་བ་གསུངས་སོ།
en: It is similar even with something taken as an extremely different thing: because it cannot be inferred like an awareness of fire from seeing smoke, it says it does not bear “comparison.”

source: །གླིང་བཞི་པ་ནི་གླིང་བཞི་པ་སྟེ། དེ་དག་སྟོང་ལ་སྟོང་གཅིག་ཅེས་བྱའོ།
en: The four continents are the four continents, and a thousand of those is the “one thousand.”

source: །སྟོང་གཅིག་པ་སྟོང་ལ་སྟོང་གཉིས་ཞེས་བྱའོ།
en: A thousand of those is the “millionfold.”

source: །སྟོང་གཉིས་པ་སྟོང་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཏེ།
en: A thousand of those is the “billionfold.”

source: ཁོར་ཡུག་གི་རི་བྱེ་བ་ཕྲག་བརྒྱ་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་ཞེས་བྱའོ།
en: With its girdle of a hundred ten million mountains, it is the “billionfold.” “

source: །གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཅེས་བྱ་བ་ནི་གྲངས་ཀྱི་བྱེ་བྲག་ཡིན་ནོ་ཞེས་འཆད་དོ།
en: As many… as there are sand particles in the Gaṅgā River” is said to be a particular number.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་ཆེ་བའི་བདག་ཉིད་བསྟན་པ་དང་། འཁོར་དེ་དག་གི་ནང་ན་ཁ་ཅིག་གི་བསམ་པ་ཤེས་ནས་ཐེ་ཚོམ་བསལ་བའི་ཕྱིར་གནས་བརྟན་ཤཱ་རིའི་བུས་ཞུ་བ་ཞུས་པ། བཅོམ་ལྡན་འདས་གང་འདི་ཉན་ཐོས་རྒྱུན་དུ་ཞུགས་པའི་ཤེས་རབ་ཅེས་བྱ་བ་ལ་སོགས་པའོ།
en: Having thus taught the greatness of a bodhisattva’s wisdom, “venerable Śāriputra,” knowing how some in the retinue think, asks a question to remove their doubt with, “Lord, the wisdom of śrāvaka stream enterers,” and so on. “

source: །ཤེས་རབ་དེ་དག་ཐམས་ཅད་ནི་ཐ་མི་དད་པ། དབེན་པ། མ་སྐྱེས་པ།
en: All those wisdoms are not broken apart; they are a detachment, are not produced, and are empty of an intrinsic nature.”

source: ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ལགས་ཏེ་ཞེས་བྱ་བ་ནི་ཐམས་ཅད་ཀྱི་ཤེས་རབ་ཀྱང་གནས་གྱུར་པའི་བདག་ཉིད་ཀྱིས་རྣམ་པར་མི་རྟོག་ཅིང་འཇིག་རྟེན་ལས་འདས་པ་ཉིད་ཡིན་ནོ་སྙམ་ནས་སེམས་ཅན་རྣམས་ཐེ་ཚོམ་སྐྱེ་བས་སོ།
en: Doubt arises in beings, thinking that the wisdoms of them all, in the form of a fundamental transformation, are nonconceptual and extraordinary.

source: །ཐ་མི་དད་ཅེས་བྱ་བ་ནི་གཅིག་པའི་བདག་ཉིད་ཡིན་པའི་ཕྱིར། དབེན་པ་ཞེས་བྱ་བ་ནི་རྣམ་པར་དག་པའི་བདག་ཉིད་ཡིན་པའི་ཕྱིར་རོ། །མ་སྐྱེས་པ་ཞེས་བྱ་བ་ནི་འདུས་མ་བྱས་པའི་བདག་ཉིད་ཡིན་པའི་ཕྱིར་རོ། །ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཞེས་བྱ་བ་ནི་ཡང་དག་པ་མ་ཡིན་པ་ཀུན་བརྟགས་པའི་ངོ་བོ་ཉིད་དང་བྲལ་བའི་བདག་ཉིད་ཡིན་པའི་ཕྱིར་རོ།
en: Because they are in the form of a unity they are “not broken apart”; because they are in the form of a purity they are “a detachment”; because they are in the form of an uncompounded phenomenon they are “not produced”; and because they are free from an intrinsic nature that is the imagination of the unreal, they are “empty of an intrinsic nature.” “

source: །ཐ་དད་དུ་དབྱེ་བ་ཞེས་བྱ་བ་ནི་རྒྱུ་དང་རྐྱེན་གྱི་དབང་གིས་གློ་བུར་བ་དག་ནི་ཐ་དད་དོ།
en: Variation”— things that are just plucked out of thin air under the power of causes and conditions are the variety. “

source: །ཁྱད་པར་ཞེས་བྱ་བ་ནི་ངོ་བོ་ཉིད་ཐ་དད་པའོ།
en: Distinction” is from having different intrinsic natures. “

source: །བཅོམ་ལྡན་འདས་དེ་ལ་ཇི་ལྟར་ཞེས་བྱ་བ་ནི་ཤེས་རབ་རང་བཞིན་གཅིག་པ་རྣམས་གཅིག་ལ་གཅིག་ཟིལ་གྱིས་གནོན་པ་མི་རིགས་སོ་ཞེས་ཞུས་པའོ།
en: So how, Lord, could…” is asking how, given that the wisdoms have the same intrinsic nature, could it be right that one surpasses another?

source: །ཤཱ་རིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་ངོ་བོ་ཉིད་དེ་ལ་བྱེ་བྲག་མེད་དུ་ཟིན་ཀྱང་སྔོན་གྱི་སྨོན་ལམ་གྱི་མཐུས་རྒྱུ་ཐ་དད་པ་དང་། འབྲས་བུ་ཐ་དད་པ་ཡོད་དོ་ཞེས་བསྟན་ཏོ།
en: With “what do you think, Śāriputra,” and so on, the Lord teaches that there are no distinctions in that intrinsic nature, but still, because of the force of an earlier prayer that is a vow there is a different cause and there is a different result.

source: །རྒྱུ་ཡང་རྣམ་པ་གསུམ་སྟེ། བསམ་པ་དང་། སྤྱོད་པ་དང་། བྱ་བའོ།
en: The cause, furthermore, is threefold: intention, practice, and work.

source: །འབྲས་བུ་ནི་རྣམ་པ་གཉིས་ཏེ། མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའོ།
en: The results are two: complete awakening and turning the wheel of the Dharma.

source: །དེ་ལ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་ཞེས་བྱ་བས་ནི་བསམ་པའི་ཆེ་བའི་བདག་ཉིད་བསྟན་ཏོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སྤྱོད་པས་ཞེས་བྱ་བས་ནི་སྤྱོད་པའི་ཆེ་བའི་བདག་ཉིད་བསྟན་ཏོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་བྱེད་པ་ཞེས་བྱ་བས་ནི་བྱ་བའི་ཆེ་བའི་བདག་ཉིད་བསྟན་ཏོ།
en: There, “furnished with the best of all aspects” teaches the greatness of motivation; “practicing the knowledge of all aspects” teaches the greatness of practice; and “working for the welfare of all beings” teaches the greatness of work. “

source: །ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱས་ཏེ་ཞེས་བྱ་བས་ནི་འབྲས་བུའི་བྱེ་བྲག་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་བསྟན་ཏོ། །སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ་ཞེས་བྱ་བས་ནི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་བསྟན་ཏོ།
en: Having fully awakened to all dharmas in all forms” teaches a feature of the result—complete awakening; “lead all beings to complete nirvāṇa” teaches turning the wheel of the Dharma.

source: །དེའི་འོག་ཏུ་འགྲེས་གསུམ་བསྟན་ཏེ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་སྨོན་ལམ་མེད་པའི་འགྲེས་དང་། རྒྱུ་དང་འབྲས་བུའི་སྨོན་ལམ་མེད་པའི་འགྲེས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལ་དེ་གཉི་ག་ཡོད་པའི་འགྲེས་སོ།
en: Then there are three connected sections of teachings: a section to do with śrāvakas and pratyekabuddhas not having the bodhisattvas’ earlier prayer that is a vow, a section to do with them not having the cause-and-effect prayer that is a vow, and a section to do with a bodhisattva having both.

source: །དེ་ལ་སྔོན་གྱི་སྨོན་ལམ་མེད་པའི་འགྲེས་ནི། ཤཱ་རིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། ཇི་ག་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་འདི་སྙམ་དུ་བདག་ཅག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་བྱས་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནས། ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་ཤེས་རབ་ཟིལ་གྱིས་གནོན་ཏོ་ཞེས་བྱ་བའི་བར་གྱི་གཞུང་གིས་བསྟན་ཏོ།
en: There, the section teaching not having the earlier prayer is the passage from, “What do you think, Śāriputra, do all śrāvakas and pratyekabuddhas think, ‘We must, having fully awakened to unsurpassed, perfect, complete awakening,’ ” and so on, up to “hence it surpasses the wisdom of śrāvakas and pratyekabuddhas.”

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་ནི་ཤེས་རབ་དང་སྙིང་རྗེའི་བདག་ཉིད་ཡིན་པའི་ཕྱིར་ཤེས་རབ་ཀྱིས་ནི་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་བཟུང་། སྙིང་རྗེས་ནི་སེམས་ཅན་རྣམས་བཟུང་ནས་བདག་སངས་རྒྱས་ཏེ་གཞན་ཡང་བྱང་ཆུབ་པར་བྱའོ་ཞེས་རྣམ་པ་གཉིས་ཀྱི་བདག་ཉིད་ཀྱིས་འཇུག་སྟེ།
en: The bodhisattvas’ earlier prayer that is a vow is in the form of wisdom and compassion, so, taking hold of complete awakening with wisdom and taking hold of beings with compassion, it operates with the twofold nature in “I must, having become awakened, awaken others too.”

source: དེ་བས་ན་སྔོན་གྱི་སྨོན་ལམ་གྱི་འགྲེས་འདི་ལ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དང་། སེམས་ཅན་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བ་བསྟན་ཏོ།
en: Hence in this section to do with the earlier prayer is a teaching about complete awakening and leading beings to complete nirvāṇa.

source: །དེའི་འོག་ཏུ་རྒྱུ་དང་འབྲས་བུའི་སྨོན་ལམ་མེད་པའི་འགྲེས་བསྟན་པ། ཤཱ་རིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། ཇི་ག་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་འདི་སྙམ་དུ། བདག་ཅག་གིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་དེ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནས། སེམས་ཅན་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ་སྙམ་དུ་སེམས་སྙམ་མམ་ཞེས་བྱ་བའི་བར་གྱི་གཞུང་གིས་བསྟན་ཏེ། འགྲེས་འདི་ལ་བདག་ཉིད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་།
en: Then, the section teaching not having the cause-and-effect prayer is the passage from, “What do you think, Śāriputra, do all these śrāvakas and pratyekabuddhas think, ‘We must, having practiced the six perfections,’ ” and so on, up to “ ‘lead infinite, countless beings beyond measure to complete nirvāṇa.’ ”

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་སྟེ་རྒྱུ་བཞི་དང་། མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དང་། སེམས་ཅན་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བ་ཞེས་བྱ་བ་འབྲས་བུ་གཉིས་དང་། ཆོས་དྲུག་བསྟན་ཏོ།
en: This section teaches six things: four causes—the work that brings personal maturity, brings beings to maturity, purifies a buddhafield, and brings the buddhadharmas to maturity—and two results: complete awakening and beings who are in complete nirvāṇa.

source: །སྤྱོད་པའི་དུས་ཀྱི་སྨོན་ལམ་འདི་ནི་འོག་ནས་འབྱུང་ངོ་།
en: The prayer that is a vow during the time of practice comes next.

source: །བྱང་ཆུབ་སེམས་དཔའ་ལ་དེ་གཉིས་ཀ་ཡོད་པར་བསྟན་པའི་འགྲེས་ནི་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདི་སྙམ་དུ་སེམས་ཏེ་ཞེས་བྱ་བ་ནས། སེམས་ཅན་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ་སྙམ་དུ་སེམས་སོ་ཞེས་བྱ་བའི་བར་གྱི་གཞུང་གིས་བསྟན་ཏོ།
en: The section teaching that bodhisattvas have them both is the passage from, “Śāriputra, a bodhisattva great being thinks…,” and so on, up to “lead infinite, countless beings beyond measure to complete nirvāṇa.”

source: །དེའི་འོག་ཏུ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་དག་གི་དཔེ་སྲིན་བུ་མེ་ཁྱེར་གྱིས་བསྟན་པ་དང་། དེའི་འོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་དཔེ་ཉི་མ་འཆར་བས་བསྟན་པ་སྟེ།
en: After that it teaches about śrāvakas and pratyekabuddhas, using the analogy of “fireflies,” and then teaches about bodhisattvas, using the analogy of “the sun” dawning.

source: དཔེའི་འགྲེས་གཉིས་ཀྱི་དོན་ནི་གསལ་བར་བསྟན་པས་ཡང་དོན་བསྟན་མི་དགོས་སོ།
en: The teaching of the topic in this section of the text with the two analogies is clear, so there is no need to teach what it means.

source: །ཡང་དེའི་འོག་ཏུ་གནས་བརྟན་གྱིས་འཁོར་གྱི་ཐེ་ཚོམ་བསལ་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བྱ་བ་ལ་སོགས་པས། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་པའི་གནས་དང་། ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་པའི་གནས་དང་། བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་སྦྱོང་བའི་གནས་གསུམ་ཞུས་པ་དང་།
en: Again, after that, to remove the retinue’s doubts, the venerable Śāriputra asks three questions, beginning with, “How, Lord, do bodhisattva great beings, having passed…,” and so on: How do they stand, having passed beyond the śrāvaka and pratyekabuddha levels; how do they stand, having reached the irreversible level; and how do they stand while purifying the awakening path?

source: དེའི་འོག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱིས་བསྐལ་པ་གྲངས་མེད་པ་དང་པོ་འདས་ནས་ས་དང་པོ་རབ་ཏུ་དགའ་བ་ཞེས་བྱ་བའི་སེམས་བསྐྱེད་པ་ནས་བཟུང་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་རྟོག་པའི་རྒྱུས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་པར་འགྱུར་ཞིང་། དེ་དག་ལས་འདས་ནས་ས་བརྒྱད་པ་ལ་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཏེ།
en: Then the Lord teaches that from “their first”— on the Pramuditā level— “production of the thought onward” after passing beyond the first uncountable eon, their conceptualization of “emptiness, signlessness, and wishlessness” that are the marks of all “dharmas” causes them to pass “beyond the śrāvaka or pratyekabuddha level”; having passed beyond those to reach “the irreversible” eighth “level”; and with “the [six] perfections” that come to maturity, purify the awakening path.

source: རྣམ་པར་སྨིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱིས་བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་སྦྱོང་བར་བསྟན་ཏོ། །ཡང་ཅི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་མ་ཐག་ཏུ། དེ་དག་གིས་མཆོད་པའི་གནས་སུ་འགྱུར་རམ། འོན་ཏེ་དུས་གཞན་ཞིག་ན་འགྱུར་སྙམ་དུ་གནས་བརྟན་ཡིད་གཉིས་སུ་གྱུར་ནས། བཅོམ་ལྡན་འདས་གང་ལ་གནས་ན་ཞེས་བྱ་བ་ལ་སོགས་པ་ཞུས་སོ།
en: Then the venerable Śāriputra is of two minds about whether the moment they pass beyond the śrāvaka and pratyekabuddha level they become worthy of their offerings or whether it is at some other time, so he makes an inquiry with, “Standing on which level, Lord, do bodhisattva [great beings],” and so on.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཐོག་མ་སེམས་དང་པོ་བསྐྱེད་ཕྱིན་ཆད་ཅེས་བྱ་བ་ལ་སོགས་པས་ས་རབ་ཏུ་དགའ་བ་ཐོབ་མ་ཐག་ཏུ་མཆོད་པའི་གནས་སུ་འགྱུར་རོ་ཞེས་བསྟན་ཏོ།
en: Then the Lord, with “in the interval from their first production of the thought,” and so on, teaches that they are worthy of their offerings the moment they reach the Pramuditā level.

source: །ཤཱ་རིའི་བུ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་བརྟེན་ནས་དགེ་བའི་ཆོས་ཐམས་ཅད་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་དེའི་གཏན་ཚིགས་བསྟན་ཏོ། །དེའི་འོག་ཏུ་ཆོས་དེ་དག་བསྟན་པ་ལ་འགྲེས་གསུམ་སྟེ་ཟག་པ་དང་བཅས་པ་དང་།
en: It teaches the reason for that with, “Because Śāriputra, it is thanks to bodhisattva great beings that all wholesome dharmas appear in the world,” and so on.

source: ཟག་པ་མེད་པའི་དགེ་བའི་ཆོས་བསྟན་པའི་འགྲེས་དང་། ཟག་པ་དང་བཅས་པའི་དགེ་བའི་རྣམ་པར་སྨིན་པ་བསྟན་པའི་འགྲེས་དང་། ཟག་པ་མེད་པའི་དགེ་བའི་རྣམ་པར་སྨིན་པ་བསྟན་པའི་འགྲེས་སོ། །དེ་ལ་ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པའི་དགེ་བའི་ཆོས་བསྟན་པའི་འགྲེས་ལ་ནི།
en: Then there are three sections that teach those dharmas: the section teaching wholesome dharmas with and without outflows, the section teaching the maturation of the wholesome with outflows, and the section teaching the maturation of the wholesome without outflows.

source: ཁྱིམ་པ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མའི་ཆོས་བསྟན་པ་དང་། ཉན་ཐོས་ཀྱི་ཆོས་བསྟན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་བསྟན་པ་སྟེ།
en: In regard to the section teaching wholesome dharmas with and without outflows there are three sections: teaching the dharmas of householders, male lay practitioners, and female lay practitioners; teaching the dharmas of śrāvakas and pratyekabuddhas; and teaching the dharmas of buddhas. “

source: འགྲེས་གསུམ་བསྟན་ཏོ། །དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་དང་། ཡན་ལག་ལྔ་དང་ལྡན་པའི་ཚུལ་ཁྲིམས་དང་། ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཚུལ་ཁྲིམས་དང་ཞེས་བྱ་བ་ཆོས་དེ་གསུམ་ནི་ཚུལ་ཁྲིམས་དང་དགེ་བསྙེན་དང་དགེ་བསྙེན་མའི་ཆོས་སོ།
en: The ten wholesome actions, the morality with five branches, the morality with eight branches”— those three dharmas are morality, and the dharmas of male lay practitioners, and female lay practitioners.

source: །བསམ་གཏན་ལ་སོགས་པའི་ལམ་གྱི་མཐའ་ལ་ཐུག་གི་བར་དག་ནི་ཉན་ཐོས་ཀྱི་ཆོས་སོ།
en: Those starting with “the concentrations” and ending with “the path” are the dharmas of śrāvakas.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་མཐའ་ལ་ཐུག་གི་བར་དུ་སངས་རྒྱས་བྱེད་པའི་ཆོས་རྣམས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་སོ།
en: The dharmas starting with “the perfections” and ending with the “distinct attributes of a buddha” are the dharmas of buddhas.

source: །དེའི་འོག་ཏུ་དགེ་བའི་ཆོས་དེ་དག་འཇིག་རྟེན་དུ་བྱུང་བས་རྒྱལ་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དག་ཡོད་པ་ཡིན་ཞེས་བྱ་བ་ལ་སོགས་པས་འདོད་པ་དང་གཟུགས་དང་གཟུགས་མེད་པའི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་བསྟན་པས་ནི། ཟག་པ་དང་བཅས་པའི་དགེ་བའི་རྣམ་པར་སྨིན་པ་བསྟན་ཏོ།
en: Then, “because those wholesome dharmas appear in the world, there are great sāla tree-like royal families in the world,” and so on, teaches beings included in the desire, form, and formless realms, so it teaches the maturation of the wholesome with outflows. “

source: །རྒྱུན་ཏུ་ཞུགས་པ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བ་ཡིན་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་བསྟན་པས་ནི་ཟག་པ་མེད་པའི་དགེ་བའི་རྣམ་པར་སྨིན་པ་བསྟན་ཏོ།
en: stream enterers appear in the world,” and so on, is a teaching about all the śrāvakas and pratyekabuddhas and “the perfectly complete buddhas,” so it teaches the maturation of the wholesome without outflows.

source: །སྦྱིན་པ་ཡོངས་སུ་སྦྱོང་ཞེས་བྱ་བ་ནི་གང་དེ་ལ་སྦྱིན་པ་བྱེད་པ་དེ་དག་འབྲས་བུ་ཆེན་པོར་འགྱུར་བ་དང་། རྣམ་པར་དག་པར་འགྱུར་བ་ལ་སྦྱིན་པ་ཡོངས་སུ་སྦྱོང་བ་ཞེས་བྱའོ།
en: As for “purifies the offering,” it says “purifies the offering” about those for whom there is a great and a purified result when they offer to them. “

source: །སྦྱིན་པ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཉིད་ཀྱི་ཕྱིར་ཞེས་བྱ་བ་ནི་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པ་ནི་དེ་ལྟ་བུའི་ཆོས་ཉིད་དེ། སྦྱིན་པ་པོ་ཡིན་པའི་ཕྱིར་རོ་ཞེས་སྟོན་ཏོ།
en: Because the offering is absolutely pure” is teaching that this is the true dharmic nature of the bodhisattvas’ offering, because they are “a giver.”

source: །དེ་ལྟར་ཇི་ལྟར་བརྩོན་པར་བྱ་བ་བསྟན་ནས། དེ་ནི་བརྩོན་པར་བྱེད་པ་རྣམས་ཀྱི་མཚན་ཉིད་གང་ཡིན་པ་ཞེས་བྱ་བ་དེ་བསྟན་པའི་ཕྱིར།
en: The defining marks of those who endeavor It has thus taught how they should endeavor.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བགྱིས་ན་བརྩོན་པ་ཞེས་བགྱི་བ་ལགས་ཞེས་ཞུས་པ་དང་།
en: To teach “the defining marks of those who endeavor,” Śāriputra makes an inquiry about them: “Lord, how are bodhisattva great beings who engage with the perfection of wisdom ‘engaged’?”

source: དེ་ནས་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་དང་། འཕགས་པའི་བདེན་པ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་། ཆོས་ཐམས་ཅད་འདུས་བྱས་དང་། འདུས་མ་བྱས་ཀྱི་དབང་གིས་ཆོས་ཐམས་ཅད་སོ་སོར་ཕུང་པོ་བདུན་དུ་བསྡུས་ཏེ།
en: Then the Lord brings all dharmas together in seven separate groups—aggregates, constituents, sense fields, noble truths, dependent origination, all compounded phenomena, and all uncompounded dharmas—and says, “You cannot say… that they ‘are engaged’ or ‘are not engaged.’ ”

source: རྣམ་པ་བདུན་གྱིས་སྟོང་པ་ཉིད་ལ་སྤྱོད་པ་ན། དེ་ཙམ་གྱིས་བརྩོན་པར་བྱ་བ་ཡོངས་སུ་རྫོགས་པ་མ་ཡིན་པའི་ཕྱིར་རེ་ཞིག་བརྩོན་པ་ཞེས་ཀྱང་མི་བྱའོ། །བརྩོན་པར་བྱ་བ་བརྩམས་པའི་ཕྱིར་བརྩོན་པ་མ་ཡིན་ནོ་ཞེས་ཀྱང་བརྗོད་པར་མི་བྱའོ་ཞེས་བསྟན་པའི་ཕྱིར་བརྩོན་ཞེ་འམ་མི་བརྩོན་ཞེས་མི་བརྗོད་དོ་ཞེས་གསུངས་སོ།
en: He does so to teach that “when” they “are practicing with these seven emptinesses,” you cannot say, first of all, that they “are engaged” because they do not fulfill how they should endeavor just by that; and you cannot say they “are not engaged” because they have started the endeavor.

source: འོ་ན་ཇི་ལྟར་ན་བརྩོན་པ་ཡིན་སྙམ་དུ་ཐེ་ཚོམ་ཟ་བ་ལ་དེ་ཅིའི་ཕྱིར་ཞེ་ན་ཞེས་བྱ་བ་གསུངས་སོ།
en: For those who entertain the doubt about how they would then engage, it says “and why?”

source: །དེ་སྐད་ཅེས་གསུངས་ནས་གཟུགས་ལ་སོགས་པ་སོ་སོའི་བྱེ་བྲག་གི་ངོ་བོ་ཉིད་དམིགས་སུ་མེད་པ་དང་། འདུས་པའི་ངོ་བོ་ཉིད་དམིགས་སུ་མེད་པ་དང་། རང་གི་མཚན་ཉིད་དམིགས་སུ་མེད་པ་དང་། ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པ་དང་། རྣམ་པ་བཞིས་སྟོང་པ་ཉིད་ལ་སྤྱོད་ན་བརྩོན་པ་ཞེས་བྱ་བར་སྟོན་ཏེ།
en: and then says they engage when they practice a fourfold emptiness: the intrinsic nature of each—of form and so on, separately—that cannot be apprehended; the intrinsic nature of them as a collection that cannot be apprehended;their defining marks that cannot be apprehended; and the totality of dharmas that cannot be apprehended.
